shunzi-ycsb/peb1B_ycsb_load.log
./pebblesdb/release/db_bench --cache_size=8388608 --db=/mnt/shunzi/test-data/wipdb/peb_ycsb --threads=4 --open_files=40000 --num=120000000 --range=120000000 --reads=2000000 --batch_size=1000 --stats_interval=10000000 --bloom_bits=16 --bg_threads=6 --value_size=100 --histogram=true --log=true --benchmarks=load,overwrite,stats --writes=10000000 --ycsb_ops_num=8000000 --seek_nexts=100 --use_existing_db=false --write_buffer_size=67108864 
Keys:       16 bytes each
Values:     100 bytes each (50 bytes after compression)
Entries:    120000000
RawSize:    13275.1 MB (estimated)
FileSize:   7553.1 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
Recover Time : 18446744073709541511
InitializeFileLevelBloomFilter Time: 1
InitializeTableCacheFileMetaData Time: 2
PebblesDB Open Time: 11743
 usWrite buffer: 65536.00 KB
Recover Time : 18446744073709550909
InitializeFileLevelBloomFilter Time: 2
InitializeTableCacheFileMetaData Time: 2
PebblesDB Open Time: 2830
 us2022/06/30-11:37:13  ... thread 0: (10000000,10000000) ops and (457513.4,457513.4) ops/second in (21.857282,21.857282) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        1       47        11        0      1073
  1        3      140         9     1027      1024
  2        4      167         8      885       883
  3        4      186         6      716       716
  4       16      356         7      770       769
  5       27      173         2      173       173
WriteAmplification: 4.3214

2022/06/30-11:37:35  ... thread 0: (10000000,20000000) ops and (447695.2,452551.1) ops/second in (22.336626,44.193908) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        7      327        22        0      2240
  1        0        0        17     1913      1907
  2        6      266        16     1907      1905
  3       17      626        16     1760      1757
  4       20      263        14     1505      1502
  5      126      743        11     1097      1095
WriteAmplification: 4.6454

2022/06/30-11:37:57  ... thread 0: (10000000,30000000) ops and (454050.5,453049.8) ops/second in (22.023982,66.217890) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        9      420        33        0      3360
  1        0        0        27     2940      2927
  2       12      465        26     2989      2987
  3       24      761        25     2800      2796
  4       62      946        23     2459      2454
  5      126      743        11     1097      1095
WriteAmplification: 4.6487

2022/06/30-11:38:20  ... thread 0: (10000000,40000000) ops and (436613.4,448825.7) ops/second in (22.903559,89.121449) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0       14      653        44        0      4480
  1        0        0        35     3827      3807
  2       19      844        35     3966      3964
  3       20      462        32     3488      3484
  4       82     1254        35     3774      3766
  5      260     1229        22     2196      2193
WriteAmplification: 4.8423

2022/06/30-11:38:43  ... thread 0: (10000000,50000000) ops and (431547.3,445260.2) ops/second in (23.172431,112.293880) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0       18      840        55        0      5647
  1        0        0        45     4807      4780
  2       22      727        43     4939      4936
  3       47     1529        43     4723      4715
  4       68      955        36     3836      3829
  5      315     1329        29     2937      2932
  6      192      218         2      218       218
WriteAmplification: 4.7917

2022/06/30-11:39:06  ... thread 0: (10000000,60000000) ops and (430360.1,442705.6) ops/second in (23.236356,135.530236) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0       20      933        66        0      6767
  1        2       78        55     5833      5799
  2       23      631        52     5879      5877
  3       51     1762        52     5760      5749
  4      100     1619        46     4860      4851
  5      361     1334        34     3475      3470
  6      339      347         6      446       446
WriteAmplification: 4.8706

2022/06/30-11:39:30  ... thread 0: (10000000,70000000) ops and (428529.7,440623.4) ops/second in (23.335603,158.865839) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0       14      653        77        0      7887
  1       12      694        69     7233      7186
  2        6      156        59     6682      6679
  3       58     2059        65     7060      7046
  4      104     1617        56     6005      5993
  5      460     2019        46     4728      4721
  6      652      605        10      799       799
WriteAmplification: 5.1114

2022/06/30-11:39:54  ... thread 0: (10000000,80000000) ops and (410159.1,436570.1) ops/second in (24.380782,183.246621) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0       19      887        89        0      9053
  1        1        9        78     8167      8111
  2       39     1587        74     8291      8288
  3       38     1281        68     7343      7329
  4      136     2161        70     7411      7397
  5      502     2211        54     5556      5549
  6      909      822        15     1168      1167
WriteAmplification: 5.1796

2022/06/30-11:40:18  ... thread 0: (10000000,90000000) ops and (425166.7,435273.0) ops/second in (23.520188,206.766809) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0       24     1120       100        0     10173
  1        4       86        87     9053      8989
  2       30     1128        82     9093      9090
  3       72     2539        81     8663      8646
  4      122     1887        70     7411      7397
  5      529     2485        58     5871      5862
  6      909      822        15     1168      1167
WriteAmplification: 5.0450

2022/06/30-11:40:42  ... thread 0: (10000000,100000000) ops and (407747.3,432354.3) ops/second in (24.524991,231.291800) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0       27     1260       112        0     11293
  1        0        0        97    10033      9960
  2       41     1473        92    10150     10146
  3       67     1935        87     9374      9356
  4      146     2212        84     8856      8839
  5      701     3469        74     7389      7379
  6      909      822        15     1168      1167
WriteAmplification: 5.1481

2022/06/30-11:41:07  ... thread 0: (10000000,110000000) ops and (403277.1,429538.8) ops/second in (24.796845,256.088645) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0       29     1353       124        0     12460
  1        3       92       109    11107     11023
  2       44     1550       101    11120     11116
  3       77     2207        98    10336     10316
  4      154     2176        93     9688      9669
  5      656     3266        83     8329      8317
  6     1744     1675        33     2587      2586
WriteAmplification: 5.2558

2022/06/30-11:41:32  ... thread 0: (10000000,120000000) ops and (402100.3,427110.0) ops/second in (24.869417,280.958062) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0       25     1167       136        0     13580
  1       25     1385       123    12413     12316
  2       16      514       101    11120     11116
  3       75     2387       109    11496     11474
  4      164     2186       103    10658     10637
  5      682     3796        95     9478      9465
  6     1938     1986        39     3023      3021
WriteAmplification: 5.2731

load         :       2.341 micros/op 427105 ops/sec;   47.2 MB/s
Microseconds per op:
Count: 120000000 Average: 2.3413  StdDev: 23.95
Min: 0  Median: 0.5006  Max: 349854
Percentiles: P50: 0.50 P75: 0.75 P99: 0.99 P99.9: 583.42 P99.99: 2782.76
------------------------------------------------------
[       0,       1 ] 119852496  99.877%  99.877% ####################
(       1,       2 ]    14797   0.012%  99.889% 
(       2,       3 ]     1509   0.001%  99.891% 
(       3,       4 ]     2020   0.002%  99.892% 
(       4,       6 ]     5062   0.004%  99.897% 
(       6,      10 ]     2427   0.002%  99.899% 
(      10,      15 ]      866   0.001%  99.899% 
(      15,      22 ]      289   0.000%  99.900% 
(      22,      34 ]      425   0.000%  99.900% 
(      34,      51 ]       85   0.000%  99.900% 
(      51,      76 ]       10   0.000%  99.900% 
(      76,     110 ]        2   0.000%  99.900% 
(     110,     170 ]        1   0.000%  99.900% 
(     170,     250 ]        1   0.000%  99.900% 
(     380,     580 ]        2   0.000%  99.900% 
(     580,     870 ]      678   0.001%  99.901% 
(     870,    1300 ]    13474   0.011%  99.912% 
(    1300,    1900 ]    44370   0.037%  99.949% 
(    1900,    2900 ]    56058   0.047%  99.995% 
(    2900,    4400 ]     3287   0.003%  99.998% 
(    4400,    6600 ]     1323   0.001%  99.999% 
(    6600,    9900 ]      180   0.000%  99.999% 
(    9900,   14000 ]       57   0.000% 100.000% 
(   14000,   22000 ]       72   0.000% 100.000% 
(   22000,   33000 ]       79   0.000% 100.000% 
(   33000,   50000 ]      347   0.000% 100.000% 
(   50000,   75000 ]       48   0.000% 100.000% 
(   75000,  110000 ]       13   0.000% 100.000% 
(  110000,  170000 ]       14   0.000% 100.000% 
(  170000,  250000 ]        5   0.000% 100.000% 
(  250000,  380000 ]        3   0.000% 100.000% 

2022/06/30-11:44:41  ... thread 0: (10000000,10000000) ops and (52932.6,52932.6) ops/second in (188.919345,188.919345) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        0        0       179        0     18110
  1        7      206       177    18110     17932
  2       25      314       165    18045     18006
  3       69      869       172    18457     18270
  4      231     3972       180    19026     18655
  5     1059     8299       154    15797     15293
  6     2547     3101        61     4667      4596
WriteAmplification: 6.1215

2022/06/30-11:44:41  ... thread 1: (10000000,10000000) ops and (52809.0,52809.0) ops/second in (189.361800,189.361800) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        0        0       179        0     18110
  1        7      206       177    18110     17932
  2       25      314       165    18045     18006
  3       69      869       172    18457     18270
  4      213     3542       180    19026     18655
  5     1092     8659       158    16227     15653
  6     2547     3101        61     4667      4596
WriteAmplification: 6.1414

2022/06/30-11:44:42  ... thread 2: (10000000,10000000) ops and (52739.8,52739.8) ops/second in (189.610214,189.610214) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        0        0       179        0     18110
  1        7      206       177    18110     17932
  2       25      314       165    18045     18006
  3       69      869       172    18457     18270
  4      213     3542       180    19026     18655
  5     1092     8659       158    16227     15653
  6     2547     3101        61     4667      4596
WriteAmplification: 6.1414

2022/06/30-11:44:42  ... thread 3: (10000000,10000000) ops and (52698.1,52698.1) ops/second in (189.760144,189.760144) seconds

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        0        0       179        0     18110
  1        4      121       177    18110     17932
  2       32      398       166    18130     18091
  3       69      869       172    18457     18270
  4      213     3542       180    19026     18655
  5     1092     8659       158    16227     15653
  6     2547     3101        61     4667      4596
WriteAmplification: 6.1460

overwrite    :       4.744 micros/op 210790 ops/sec;   23.3 MB/s (10000000 ops)
Microseconds per op:
Count: 40000000 Average: 18.9413  StdDev: 25.75
Min: 0  Median: 0.5016  Max: 335622
Percentiles: P50: 0.50 P75: 0.75 P99: 0.99 P99.9: 1431.25 P99.99: 21618.35
------------------------------------------------------
[       0,       1 ] 39871053  99.678%  99.678% ####################
(       1,       2 ]    36664   0.092%  99.769% 
(       2,       3 ]    14375   0.036%  99.805% 
(       3,       4 ]    15775   0.039%  99.845% 
(       4,       6 ]     3603   0.009%  99.854% 
(       6,      10 ]      846   0.002%  99.856% 
(      10,      15 ]    10342   0.026%  99.882% 
(      15,      22 ]     6086   0.015%  99.897% 
(      22,      34 ]      988   0.002%  99.899% 
(      34,      51 ]      170   0.000%  99.900% 
(      51,      76 ]       54   0.000%  99.900% 
(      76,     110 ]       29   0.000%  99.900% 
(     110,     170 ]        2   0.000%  99.900% 
(     250,     380 ]        2   0.000%  99.900% 
(     380,     580 ]        1   0.000%  99.900% 
(     580,     870 ]        1   0.000%  99.900% 
(     870,    1300 ]        2   0.000%  99.900% 
(    1300,    1900 ]       32   0.000%  99.900% 
(    1900,    2900 ]       20   0.000%  99.900% 
(    2900,    4400 ]       17   0.000%  99.900% 
(    4400,    6600 ]       76   0.000%  99.900% 
(    6600,    9900 ]      584   0.001%  99.902% 
(    9900,   14000 ]     5835   0.015%  99.916% 
(   14000,   22000 ]    30918   0.077%  99.994% 
(   22000,   33000 ]     1405   0.004%  99.997% 
(   33000,   50000 ]      490   0.001%  99.998% 
(   50000,   75000 ]      508   0.001% 100.000% 
(   75000,  110000 ]       72   0.000% 100.000% 
(  110000,  170000 ]       22   0.000% 100.000% 
(  170000,  250000 ]       24   0.000% 100.000% 
(  250000,  380000 ]        4   0.000% 100.000%